tests/results/p4/20260610_192347_p1_replica_down_exclusion_k6.txt

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /home/blend-pc-juan/Documentos/Proyecto Personal/AdoptiEntregaFInal/AdoptiFinal/Compose/tests/perf/pets_load_test.js
        output: json (/home/blend-pc-juan/Documentos/Proyecto Personal/AdoptiEntregaFInal/AdoptiFinal/Compose/tests/results/p4/20260610_192347_p1_replica_down_exclusion_raw.json)

     scenarios: (100.00%) 1 scenario, 300 max VUs, 1m0s max duration (incl. graceful stop):
              * p1_constant_arrival: 40.00 iterations/s for 30s (maxVUs: 300, gracefulStop: 30s)


running (0m01.0s), 002/300 VUs, 38 complete and 0 interrupted iterations
p1_constant_arrival   [   3% ] 002/300 VUs  01.0s/30s  40.00 iters/s

running (0m02.0s), 002/300 VUs, 78 complete and 0 interrupted iterations
p1_constant_arrival   [   7% ] 002/300 VUs  02.0s/30s  40.00 iters/s

running (0m03.0s), 002/300 VUs, 118 complete and 0 interrupted iterations
p1_constant_arrival   [  10% ] 002/300 VUs  03.0s/30s  40.00 iters/s

running (0m04.0s), 002/300 VUs, 158 complete and 0 interrupted iterations
p1_constant_arrival   [  13% ] 002/300 VUs  04.0s/30s  40.00 iters/s

running (0m05.0s), 002/300 VUs, 198 complete and 0 interrupted iterations
p1_constant_arrival   [  17% ] 002/300 VUs  05.0s/30s  40.00 iters/s

running (0m06.0s), 002/300 VUs, 238 complete and 0 interrupted iterations
p1_constant_arrival   [  20% ] 002/300 VUs  06.0s/30s  40.00 iters/s

running (0m07.0s), 002/300 VUs, 278 complete and 0 interrupted iterations
p1_constant_arrival   [  23% ] 002/300 VUs  07.0s/30s  40.00 iters/s

running (0m08.0s), 002/300 VUs, 318 complete and 0 interrupted iterations
p1_constant_arrival   [  27% ] 002/300 VUs  08.0s/30s  40.00 iters/s

running (0m09.0s), 002/300 VUs, 358 complete and 0 interrupted iterations
p1_constant_arrival   [  30% ] 002/300 VUs  09.0s/30s  40.00 iters/s

running (0m10.0s), 002/300 VUs, 398 complete and 0 interrupted iterations
p1_constant_arrival   [  33% ] 002/300 VUs  10.0s/30s  40.00 iters/s

running (0m11.0s), 002/300 VUs, 438 complete and 0 interrupted iterations
p1_constant_arrival   [  37% ] 002/300 VUs  11.0s/30s  40.00 iters/s

running (0m12.0s), 002/300 VUs, 478 complete and 0 interrupted iterations
p1_constant_arrival   [  40% ] 002/300 VUs  12.0s/30s  40.00 iters/s

running (0m13.0s), 002/300 VUs, 518 complete and 0 interrupted iterations
p1_constant_arrival   [  43% ] 002/300 VUs  13.0s/30s  40.00 iters/s

running (0m14.0s), 002/300 VUs, 558 complete and 0 interrupted iterations
p1_constant_arrival   [  47% ] 002/300 VUs  14.0s/30s  40.00 iters/s

running (0m15.0s), 002/300 VUs, 598 complete and 0 interrupted iterations
p1_constant_arrival   [  50% ] 002/300 VUs  15.0s/30s  40.00 iters/s

running (0m16.0s), 002/300 VUs, 638 complete and 0 interrupted iterations
p1_constant_arrival   [  53% ] 002/300 VUs  16.0s/30s  40.00 iters/s

running (0m17.0s), 002/300 VUs, 678 complete and 0 interrupted iterations
p1_constant_arrival   [  57% ] 002/300 VUs  17.0s/30s  40.00 iters/s

running (0m18.0s), 002/300 VUs, 718 complete and 0 interrupted iterations
p1_constant_arrival   [  60% ] 002/300 VUs  18.0s/30s  40.00 iters/s

running (0m19.0s), 001/300 VUs, 759 complete and 0 interrupted iterations
p1_constant_arrival   [  63% ] 001/300 VUs  19.0s/30s  40.00 iters/s

running (0m20.0s), 002/300 VUs, 798 complete and 0 interrupted iterations
p1_constant_arrival   [  67% ] 002/300 VUs  20.0s/30s  40.00 iters/s

running (0m21.0s), 002/300 VUs, 838 complete and 0 interrupted iterations
p1_constant_arrival   [  70% ] 002/300 VUs  21.0s/30s  40.00 iters/s

running (0m22.0s), 002/300 VUs, 878 complete and 0 interrupted iterations
p1_constant_arrival   [  73% ] 002/300 VUs  22.0s/30s  40.00 iters/s

running (0m23.0s), 002/300 VUs, 918 complete and 0 interrupted iterations
p1_constant_arrival   [  77% ] 002/300 VUs  23.0s/30s  40.00 iters/s

running (0m24.0s), 002/300 VUs, 958 complete and 0 interrupted iterations
p1_constant_arrival   [  80% ] 002/300 VUs  24.0s/30s  40.00 iters/s

running (0m25.0s), 002/300 VUs, 998 complete and 0 interrupted iterations
p1_constant_arrival   [  83% ] 002/300 VUs  25.0s/30s  40.00 iters/s

running (0m26.0s), 002/300 VUs, 1038 complete and 0 interrupted iterations
p1_constant_arrival   [  87% ] 002/300 VUs  26.0s/30s  40.00 iters/s

running (0m27.0s), 002/300 VUs, 1078 complete and 0 interrupted iterations
p1_constant_arrival   [  90% ] 002/300 VUs  27.0s/30s  40.00 iters/s

running (0m28.0s), 002/300 VUs, 1118 complete and 0 interrupted iterations
p1_constant_arrival   [  93% ] 002/300 VUs  28.0s/30s  40.00 iters/s

running (0m29.0s), 002/300 VUs, 1158 complete and 0 interrupted iterations
p1_constant_arrival   [  97% ] 002/300 VUs  29.0s/30s  40.00 iters/s

running (0m30.0s), 002/300 VUs, 1198 complete and 0 interrupted iterations
p1_constant_arrival   [ 100% ] 002/300 VUs  30.0s/30s  40.00 iters/s

     ✓ status 200

   ✓ checks.........................: 100.00% ✓ 1201      ✗ 0
     data_received..................: 1.2 MB  38 kB/s
     data_sent......................: 361 kB  12 kB/s
     http_req_blocked...............: avg=917.77µs min=6.07µs  med=9.01µs  max=12.61ms  p(90)=3.66ms   p(95)=3.8ms
     http_req_connecting............: avg=39.61µs  min=0s      med=0s      max=8.99ms   p(90)=129.62µs p(95)=142.54µs
   ✓ http_req_duration..............: avg=43.09ms  min=9.84ms  med=11.27ms max=516.6ms  p(90)=13.2ms   p(95)=511.14ms
       { expected_response:true }...: avg=43.09ms  min=9.84ms  med=11.27ms max=516.6ms  p(90)=13.2ms   p(95)=511.14ms
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 1201
     http_req_receiving.............: avg=66.72µs  min=32.47µs med=65.72µs max=249.12µs p(90)=82.41µs  p(95)=89.88µs
     http_req_sending...............: avg=30.23µs  min=15.78µs med=25.84µs max=166.99µs p(90)=45.39µs  p(95)=50.98µs
     http_req_tls_handshaking.......: avg=848.89µs min=0s      med=0s      max=4.97ms   p(90)=3.44ms   p(95)=3.59ms
     http_req_waiting...............: avg=42.99ms  min=9.73ms  med=11.18ms max=516.49ms p(90)=13.1ms   p(95)=511.03ms
   ✓ http_reqs......................: 1201    39.391796/s
     iteration_duration.............: avg=44.2ms   min=10.2ms  med=11.93ms max=517.95ms p(90)=15.53ms  p(95)=512.13ms
     iterations.....................: 1201    39.391796/s
     vus............................: 2       min=1       max=2
     vus_max........................: 300     min=300     max=300


running (0m30.5s), 000/300 VUs, 1201 complete and 0 interrupted iterations
p1_constant_arrival ✓ [ 100% ] 000/300 VUs  30s  40.00 iters/s